Revit 2027 API
TopographySurface.Create(Document, IList<XYZ>) Method
Note: This API is now obsolete.
 Creates a new topography surface element and adds it to the document.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
public static TopographySurface Create(
	Document document,
	IList<XYZ> points
)
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>
Public Shared Function Create (
	document As Document,
	points As IList(Of XYZ)
) As TopographySurface
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
static TopographySurface^ Create(
	Document^ document,
	IList<XYZ^>^ points
)
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>]
static member Create :
        document : Document *
        points : IList<XYZ> -> TopographySurface
Parameters
document Document
 The document to be modified.
points IList<XYZ>
 A collection of points. The points represent an enclosed area in the XY plane. There can be only one point in the same XY location.
Return Value
TopographySurface
 The new topography surface.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- There are no points in the input points set. -or- There were not enough points to form a valid region (at least 3 are required), or the points were collinear ignoring elevation. -or- One or more points shared the same XY location (even with different elevations). This is not permitted for topography surfaces.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 The document will be regenerated during the creation of this topography surface element.
See Also
Reference
TopographySurface Class
Create Overload
Autodesk.Revit.DB.Architecture Namespace